---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ELASeparationLinesOverlap
source: html/577baeef-b75f-877b-5ee1-ff2ed892d7fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OverlapFailures.ELASeparationLinesOverlap Property

Highlighted area based load boundary lines overlap. One of them may be ignored when Revit finds load area boundaries. Delete one of the lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId ELASeparationLinesOverlap { get; }
```